other_pages/10.ejercicio/procedimiento.html
---
layout: ejercicios
title: Ejercicio Sistematización de predios
---
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga6976f4">1. Objetivo</a></li>
<li><a href="#org069eb18">2. Procedimiento</a>
<ul>
<li><a href="#orge62de7e">2.1. a. Calcular</a></li>
<li><a href="#orge3f9fba">2.2. b. En base a las cotas calculadas,</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga6976f4" class="outline-2">
<h2 id="orga6976f4"><span class="section-number-2">1.</span> Objetivo</h2>
<div class="outline-text-2" id="text-1">
<p>
El objetivo de los dos ejercicios es calcular el volumen del suelo que deben mover.
</p>
</div>
</div>

<div id="outline-container-org069eb18" class="outline-2">
<h2 id="org069eb18"><span class="section-number-2">2.</span> Procedimiento</h2>
<div class="outline-text-2" id="text-2">
<p>
El procedimiento que queremos que apliquen es el siguiente:
</p>

<ol class="org-ol">
<li>Ubicar el centro de gravedad o centroide (utilizar AutoCAD, funcion
Region) y asignarle el promedio de las cotas naturales de cada
predio.</li>
<li>Utilizar el valor del centroide obtenido para calcular la cota que
le correspondería a cada uno de los predios respetando las
pendientes propuestas. Una alternativa para realizar esto puede ser
(ejercicio 1):</li>
</ol>
</div>

<div id="outline-container-orge62de7e" class="outline-3">
<h3 id="orge62de7e"><span class="section-number-3">2.1.</span> a. Calcular</h3>
<div class="outline-text-3" id="text-2-1">
<p>
la cota que le corresponde al centro de los predios que están
alineados en sentido vertical con el centroide. Considerar que la
pendiente que hay que conservar es 1\textperthousand (uno por mil): 
</p>

<p>
Para el predio que se encuentra al norte del centroide, al desplazarse
12,5m, la cota aumenta \[ 8.342m + 12,5m * \frac{1m}{1000m} = 8,35m \]
</p>

<p>
\[(\text{cota centroide}) + (\text{distancia}) * (\text{pendiente}) = (\text{cota que asigno al predio})\]
</p>

<p>
Para el predio que se encuentra al sur del centroide desplazarse
12,5m, la cota disminuye \[8.342m - 12,5m * \frac{1m}{1000m} = 8,33m\]
</p>

<p>
\[(\text{cota centroide}) - (\text{distancia}) * (\text{pendiente}) = (\text{cota que asigno al predio})\]
</p>
</div>
</div>

<div id="outline-container-orge3f9fba" class="outline-3">
<h3 id="orge3f9fba"><span class="section-number-3">2.2.</span> b. En base a las cotas calculadas,</h3>
<div class="outline-text-3" id="text-2-2">
<p>
desplazarse en sentido este-oeste al resto de los predios considerando
que la pendiente que hay que conservar es 2\textperthousand: 
</p>

<p>
Para el predio que se encuentra al oeste del primer predio calculado
(cota 8,35), desplazarse en sentido este-oeste 25 metros, la cota
aumenta: \[8.35m + 25m * \frac{2m}{1000m} = 8,40m\]
</p>

<p>
\[(\text{cota centroide}) + (\text{distancia}) * (\text{pendiente}) = (\text{cota que asigno al predio})\]
</p>

<p>
Para el resto de los predios realizan el mismo cálculo hasta obtener
las cotas de cada uno. 
</p>

<p>
Una vez obtenidas, las cotas naturales se restan de las calculadas
(cota roja) y se calculan dos sumatorias, una positiva
(correspondiente a aquellos predios con cota superior a la calculada y
de donde se realizaría el desmonte) y otra negativa (correspondiente a
aquellos predios con cota inferior a la calculada, donde se realizaría
el relleno). 
</p>

<p>
Como control, se verifica que el modulo de la diferencia de las dos
sumatorias, sea más chico que el 10% del modulo del valor más grande
de las dos sumatorias: 
</p>

<ol class="org-ol">
<li>Sumar, con su signo, las dos sumatorias anteriores, valor Z
(cercano a 0).</li>
<li>Calcular el 10% de cada sumatoria (negativa y positiva), en valor
absoluto (T1 y T2).</li>
<li>Seleccionar T1, si es mayor que T2, o T2 si es mayor que T1.</li>
<li>Comparar la T elegida con el valor de Z, si T es mayor, se puede
continuar con el cálculo, sino se debe modificar la cota del
centroide para que la diferencia disminuya, y recalcular todas las
cotas calculadas para cada predio.</li>
</ol>

<p>
Una vez verificada la diferencia, se calcula la Cota Roja Media Ponderada:
</p>

<ol class="org-ol">
<li>Calcular el valor absoluto de la cota roja de cada predio
multiplicado por su peso (en el ejercicio 1 los pesos son 1, y en
el 2 están indicados).</li>
<li>Sumar los valores de cada predio calculados en 1) y dividir por la
suma de los pesos.</li>
</ol>

<p>
Finalmente el volumen de tierra a mover se calcula como:
</p>

<p>
\[(\frac{1}{2}) * (\text{Superficie Total}) * (\text{Cota Roja Media Ponderada})\]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-22 sáb 13:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
